balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ09GS302.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="RCOUNT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="RCOUNT" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RCOUNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RCOUNT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DCOUNT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="DCOUNT" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DCOUNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DCOUNT" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="DOSTART" edc:desc="" edc:islanghidden="true" edc:name="DOSTART" edc:nzwidth="0x18">
          <edc:SFRModeList/>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Address"/>
          <edc:SFRDef edc:access="nnnnnnnnnnnnnnnr" edc:cname="DOSTARTL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxx0" edc:name="DOSTARTL" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxx0">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DOSTARTL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DOSTARTL" edc:nzwidth="0x10"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----------nnnnnn" edc:cname="DOSTARTH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------xxxxxx" edc:name="DOSTARTH" edc:nzwidth="0x10" edc:por="----------xxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DOSTARTH" edc:desc="" edc:islanghidden="true" edc:mask="0x3f" edc:name="DOSTARTH" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DOEND" edc:desc="" edc:islanghidden="true" edc:name="DOEND" edc:nzwidth="0x18">
          <edc:SFRModeList/>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Address"/>
          <edc:SFRDef edc:access="nnnnnnnnnnnnnnnr" edc:cname="DOENDL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxx0" edc:name="DOENDL" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxx0">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DOENDL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DOENDL" edc:nzwidth="0x10"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----------nnnnnn" edc:cname="DOENDH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------xxxxxx" edc:name="DOENDH" edc:nzwidth="0x10" edc:por="----------xxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DOENDH" edc:desc="" edc:islanghidden="true" edc:mask="0x3f" edc:name="DOENDH" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="rrccrcrnnnnrnnnn" edc:cname="SR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SR" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:desc="" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA" edc:desc="" edc:mask="0x1" edc:name="RA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IPL" edc:desc="" edc:mask="0x7" edc:name="IPL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DA" edc:desc="" edc:mask="0x1" edc:name="DA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SAB" edc:desc="" edc:mask="0x1" edc:name="SAB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OAB" edc:desc="" edc:mask="0x1" edc:name="OAB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SB" edc:desc="" edc:mask="0x1" edc:name="SB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SA" edc:desc="" edc:mask="0x1" edc:name="SA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OB" edc:desc="" edc:mask="0x1" edc:name="OB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OA" edc:desc="" edc:mask="0x1" edc:name="OA" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="IPL0" edc:desc="" edc:mask="0x1" edc:name="IPL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPL1" edc:desc="" edc:mask="0x1" edc:name="IPL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPL2" edc:desc="" edc:mask="0x1" edc:name="IPL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----wrrrnnnncnnn" edc:cname="CORCON" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----000000100000" edc:name="CORCON" edc:nzwidth="0x10" edc:por="----000000100000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IF" edc:desc="" edc:mask="0x1" edc:name="IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RND" edc:desc="" edc:mask="0x1" edc:name="RND" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSV" edc:desc="" edc:mask="0x1" edc:name="PSV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IPL3" edc:desc="" edc:mask="0x1" edc:name="IPL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACCSAT" edc:desc="" edc:mask="0x1" edc:name="ACCSAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SATDW" edc:desc="" edc:mask="0x1" edc:name="SATDW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SATB" edc:desc="" edc:mask="0x1" edc:name="SATB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SATA" edc:desc="" edc:mask="0x1" edc:name="SATA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DL" edc:desc="" edc:mask="0x7" edc:name="DL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="EDT" edc:desc="" edc:mask="0x1" edc:name="EDT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="US" edc:desc="DSP Multiply Unsigned/Signed Control bit" edc:mask="0x1" edc:name="US" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="DL0" edc:desc="" edc:mask="0x1" edc:name="DL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DL1" edc:desc="" edc:mask="0x1" edc:name="DL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DL2" edc:desc="" edc:mask="0x1" edc:name="DL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
