balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ09GS302.PIC
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="ADPCFG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="ADPCFG" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCFG0" edc:desc="" edc:mask="0x1" edc:name="PCFG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG1" edc:desc="" edc:mask="0x1" edc:name="PCFG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG2" edc:desc="" edc:mask="0x1" edc:name="PCFG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG3" edc:desc="" edc:mask="0x1" edc:name="PCFG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG4" edc:desc="" edc:mask="0x1" edc:name="PCFG4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG5" edc:desc="" edc:mask="0x1" edc:name="PCFG5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG6" edc:desc="" edc:mask="0x1" edc:name="PCFG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG7" edc:desc="" edc:mask="0x1" edc:name="PCFG7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---------n--nnnn" edc:cname="ADSTAT" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0--0000" edc:name="ADSTAT" edc:nzwidth="0x10" edc:por="---------0--0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P0RDY" edc:desc="" edc:mask="0x1" edc:name="P0RDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1RDY" edc:desc="" edc:mask="0x1" edc:name="P1RDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2RDY" edc:desc="" edc:mask="0x1" edc:name="P2RDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3RDY" edc:desc="" edc:mask="0x1" edc:name="P3RDY" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="P6RDY" edc:desc="" edc:mask="0x1" edc:name="P6RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnn-" edc:cname="ADBASE" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000-" edc:name="ADBASE" edc:nzwidth="0x10" edc:por="000000000000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADBASE" edc:desc="" edc:islanghidden="true" edc:mask="0x7fff" edc:name="ADBASE" edc:nzwidth="0xf"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCPC0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADCPC0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSRC0" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC0" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG0" edc:desc="" edc:mask="0x1" edc:name="SWTRG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND0" edc:desc="" edc:mask="0x1" edc:name="PEND0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN0" edc:desc="" edc:mask="0x1" edc:name="IRQEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC1" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC1" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG1" edc:desc="" edc:mask="0x1" edc:name="SWTRG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND1" edc:desc="" edc:mask="0x1" edc:name="PEND1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN1" edc:desc="" edc:mask="0x1" edc:name="IRQEN1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSRC00" edc:desc="" edc:mask="0x1" edc:name="TRGSRC00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC01" edc:desc="" edc:mask="0x1" edc:name="TRGSRC01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC02" edc:desc="" edc:mask="0x1" edc:name="TRGSRC02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC03" edc:desc="" edc:mask="0x1" edc:name="TRGSRC03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC04" edc:desc="" edc:mask="0x1" edc:name="TRGSRC04" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRGSRC10" edc:desc="" edc:mask="0x1" edc:name="TRGSRC10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC11" edc:desc="" edc:mask="0x1" edc:name="TRGSRC11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC12" edc:desc="" edc:mask="0x1" edc:name="TRGSRC12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC13" edc:desc="" edc:mask="0x1" edc:name="TRGSRC13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC14" edc:desc="" edc:mask="0x1" edc:name="TRGSRC14" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCPC1" edc:desc="" edc:impl="0xff00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADCPC1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSRC2" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC2" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG2" edc:desc="" edc:mask="0x1" edc:name="SWTRG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND2" edc:desc="" edc:mask="0x1" edc:name="PEND2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN2" edc:desc="" edc:mask="0x1" edc:name="IRQEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC3" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC3" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="SWTRG3" edc:desc="" edc:mask="0x1" edc:name="SWTRG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PEND3" edc:desc="" edc:mask="0x1" edc:name="PEND3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRQEN3" edc:desc="" edc:mask="0x1" edc:name="IRQEN3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSRC20" edc:desc="" edc:mask="0x1" edc:name="TRGSRC20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC21" edc:desc="" edc:mask="0x1" edc:name="TRGSRC21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC22" edc:desc="" edc:mask="0x1" edc:name="TRGSRC22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC23" edc:desc="" edc:mask="0x1" edc:name="TRGSRC23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC24" edc:desc="" edc:mask="0x1" edc:name="TRGSRC24" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---------nnnnnnn" edc:cname="ADCPC3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0000000" edc:name="ADCPC3" edc:nzwidth="0x10" edc:por="---------0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSRC6" edc:desc="" edc:mask="0x1f" edc:name="TRGSRC6" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="SWTRG6" edc:desc="" edc:mask="0x1" edc:name="SWTRG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEND6" edc:desc="" edc:mask="0x1" edc:name="PEND6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQEN6" edc:desc="" edc:mask="0x1" edc:name="IRQEN6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSRC60" edc:desc="" edc:mask="0x1" edc:name="TRGSRC60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC61" edc:desc="" edc:mask="0x1" edc:name="TRGSRC61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC62" edc:desc="" edc:mask="0x1" edc:name="TRGSRC62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC63" edc:desc="" edc:mask="0x1" edc:name="TRGSRC63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSRC64" edc:desc="" edc:mask="0x1" edc:name="TRGSRC64" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="14"/>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF0" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="ADCBUF3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="ADCBUF3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCBUF3" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ADCBUF3" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
