balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ09GS302.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="LEBCON4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000---" edc:name="LEBCON4" edc:nzwidth="16" edc:por="0000000000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB" edc:desc="" edc:mask="0x7f" edc:name="LEB" edc:nzwidth="7"/>
              <edc:SFRFieldDef edc:cname="CLLEBEN" edc:desc="" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:desc="" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLF" edc:desc="" edc:mask="0x1" edc:name="PLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLR" edc:desc="" edc:mask="0x1" edc:name="PLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x1" edc:name="PHF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x1" edc:name="PHR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nn--------nnnnnn" edc:cname="AUXCON4" edc:desc="" edc:impl="0xc03f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--------000000" edc:name="AUXCON4" edc:nzwidth="16" edc:por="00--------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHOPLEN" edc:desc="" edc:mask="0x1" edc:name="CHOPLEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPHEN" edc:desc="" edc:mask="0x1" edc:name="CHOPHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL" edc:desc="" edc:mask="0xf" edc:name="CHOPSEL" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="HRDDIS" edc:desc="" edc:mask="0x1" edc:name="HRDDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HRPDIS" edc:desc="" edc:mask="0x1" edc:name="HRPDIS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="96"/>
        <edc:SFRDef edc:access="n----nnn--nnnnnn" edc:cname="ISRCCON" edc:desc="" edc:impl="0x873f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="x----xxx--xxxxxx" edc:name="ISRCCON" edc:nzwidth="16" edc:por="x----xxx--xxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISRCCAL" edc:desc="" edc:mask="0x3f" edc:name="ISRCCAL" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OUTSEL" edc:desc="" edc:mask="0x7" edc:name="OUTSEL" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ISRCEN" edc:desc="" edc:mask="0x1" edc:name="ISRCEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="62"/>
        <edc:SFRDef edc:access="n-nnnnnnnnnnnnnn" edc:cname="CMPCON1" edc:desc="" edc:impl="0xffd7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000000000000" edc:name="CMPCON1" edc:nzwidth="0x10" edc:por="0-00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RANGE" edc:desc="" edc:mask="0x1" edc:name="RANGE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMPPOL" edc:desc="" edc:mask="0x1" edc:name="CMPPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HGAIN" edc:desc="" edc:mask="0x1" edc:name="HGAIN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMPSTAT" edc:desc="" edc:mask="0x1" edc:name="CMPSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HYSPOL" edc:desc="" edc:mask="0x1" edc:name="HYSPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EXTREF" edc:desc="" edc:mask="0x1" edc:name="EXTREF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INSEL" edc:desc="" edc:mask="0x3" edc:name="INSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FCLKSEL" edc:desc="" edc:mask="0x1" edc:name="FCLKSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTREN" edc:desc="" edc:mask="0x1" edc:name="FLTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYSSEL" edc:desc="" edc:mask="0x3" edc:name="HYSSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CMPSIDL" edc:desc="" edc:mask="0x1" edc:name="CMPSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CMPON" edc:desc="" edc:mask="0x1" edc:name="CMPON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="INSEL0" edc:desc="" edc:mask="0x1" edc:name="INSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INSEL1" edc:desc="" edc:mask="0x1" edc:name="INSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="CMPDAC1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="CMPDAC1" edc:nzwidth="0x10" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMREF" edc:desc="" edc:mask="0x3ff" edc:name="CMREF" edc:nzwidth="0xa"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CMREF0" edc:desc="" edc:mask="0x1" edc:name="CMREF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF1" edc:desc="" edc:mask="0x1" edc:name="CMREF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF2" edc:desc="" edc:mask="0x1" edc:name="CMREF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF3" edc:desc="" edc:mask="0x1" edc:name="CMREF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF4" edc:desc="" edc:mask="0x1" edc:name="CMREF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF5" edc:desc="" edc:mask="0x1" edc:name="CMREF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF6" edc:desc="" edc:mask="0x1" edc:name="CMREF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF7" edc:desc="" edc:mask="0x1" edc:name="CMREF7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF8" edc:desc="" edc:mask="0x1" edc:name="CMREF8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF9" edc:desc="" edc:mask="0x1" edc:name="CMREF9" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnnnnnnnnnn" edc:cname="CMPCON2" edc:desc="" edc:impl="0xffd7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000000000000" edc:name="CMPCON2" edc:nzwidth="0x10" edc:por="0-00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RANGE" edc:desc="" edc:mask="0x1" edc:name="RANGE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMPPOL" edc:desc="" edc:mask="0x1" edc:name="CMPPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HGAIN" edc:desc="" edc:mask="0x1" edc:name="HGAIN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMPSTAT" edc:desc="" edc:mask="0x1" edc:name="CMPSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HYSPOL" edc:desc="" edc:mask="0x1" edc:name="HYSPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EXTREF" edc:desc="" edc:mask="0x1" edc:name="EXTREF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INSEL" edc:desc="" edc:mask="0x3" edc:name="INSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FCLKSEL" edc:desc="" edc:mask="0x1" edc:name="FCLKSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTREN" edc:desc="" edc:mask="0x1" edc:name="FLTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYSSEL" edc:desc="" edc:mask="0x3" edc:name="HYSSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CMPSIDL" edc:desc="" edc:mask="0x1" edc:name="CMPSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CMPON" edc:desc="" edc:mask="0x1" edc:name="CMPON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="INSEL0" edc:desc="" edc:mask="0x1" edc:name="INSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INSEL1" edc:desc="" edc:mask="0x1" edc:name="INSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="CMPDAC2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="CMPDAC2" edc:nzwidth="0x10" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMREF" edc:desc="" edc:mask="0x3ff" edc:name="CMREF" edc:nzwidth="0xa"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CMREF0" edc:desc="" edc:mask="0x1" edc:name="CMREF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF1" edc:desc="" edc:mask="0x1" edc:name="CMREF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF2" edc:desc="" edc:mask="0x1" edc:name="CMREF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF3" edc:desc="" edc:mask="0x1" edc:name="CMREF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF4" edc:desc="" edc:mask="0x1" edc:name="CMREF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF5" edc:desc="" edc:mask="0x1" edc:name="CMREF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF6" edc:desc="" edc:mask="0x1" edc:name="CMREF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF7" edc:desc="" edc:mask="0x1" edc:name="CMREF7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF8" edc:desc="" edc:mask="0x1" edc:name="CMREF8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF9" edc:desc="" edc:mask="0x1" edc:name="CMREF9" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="312"/>
        <edc:SFRDef edc:access="--nnnnnn--------" edc:cname="RPINR0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--------" edc:name="RPINR0" edc:nzwidth="0x10" edc:por="--111111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="INT1R" edc:desc="" edc:mask="0x3f" edc:name="INT1R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="INT1R0" edc:desc="" edc:mask="0x1" edc:name="INT1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R1" edc:desc="" edc:mask="0x1" edc:name="INT1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R2" edc:desc="" edc:mask="0x1" edc:name="INT1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R3" edc:desc="" edc:mask="0x1" edc:name="INT1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R4" edc:desc="" edc:mask="0x1" edc:name="INT1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R5" edc:desc="" edc:mask="0x1" edc:name="INT1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPINR1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR1" edc:nzwidth="0x10" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2R" edc:desc="" edc:mask="0x3f" edc:name="INT2R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT2R0" edc:desc="" edc:mask="0x1" edc:name="INT2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R1" edc:desc="" edc:mask="0x1" edc:name="INT2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R2" edc:desc="" edc:mask="0x1" edc:name="INT2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R3" edc:desc="" edc:mask="0x1" edc:name="INT2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R4" edc:desc="" edc:mask="0x1" edc:name="INT2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R5" edc:desc="" edc:mask="0x1" edc:name="INT2R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--------" edc:cname="RPINR2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--------" edc:name="RPINR2" edc:nzwidth="0x10" edc:por="--111111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="T1CKR" edc:desc="" edc:mask="0x3f" edc:name="T1CKR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="T1CKR0" edc:desc="" edc:mask="0x1" edc:name="T1CKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKR1" edc:desc="" edc:mask="0x1" edc:name="T1CKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKR2" edc:desc="" edc:mask="0x1" edc:name="T1CKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKR3" edc:desc="" edc:mask="0x1" edc:name="T1CKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKR4" edc:desc="" edc:mask="0x1" edc:name="T1CKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKR5" edc:desc="" edc:mask="0x1" edc:name="T1CKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPINR3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR3" edc:nzwidth="0x10" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T2CKR" edc:desc="" edc:mask="0x3f" edc:name="T2CKR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2CKR0" edc:desc="" edc:mask="0x1" edc:name="T2CKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR1" edc:desc="" edc:mask="0x1" edc:name="T2CKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR2" edc:desc="" edc:mask="0x1" edc:name="T2CKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR3" edc:desc="" edc:mask="0x1" edc:name="T2CKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR4" edc:desc="" edc:mask="0x1" edc:name="T2CKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR5" edc:desc="" edc:mask="0x1" edc:name="T2CKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPINR7" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR7" edc:nzwidth="0x10" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC1R" edc:desc="" edc:mask="0x3f" edc:name="IC1R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IC1R0" edc:desc="" edc:mask="0x1" edc:name="IC1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R1" edc:desc="" edc:mask="0x1" edc:name="IC1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R2" edc:desc="" edc:mask="0x1" edc:name="IC1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R3" edc:desc="" edc:mask="0x1" edc:name="IC1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R4" edc:desc="" edc:mask="0x1" edc:name="IC1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R5" edc:desc="" edc:mask="0x1" edc:name="IC1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPINR11" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR11" edc:nzwidth="0x10" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCFAR" edc:desc="" edc:mask="0x3f" edc:name="OCFAR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OCFAR0" edc:desc="" edc:mask="0x1" edc:name="OCFAR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR1" edc:desc="" edc:mask="0x1" edc:name="OCFAR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR2" edc:desc="" edc:mask="0x1" edc:name="OCFAR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR3" edc:desc="" edc:mask="0x1" edc:name="OCFAR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR4" edc:desc="" edc:mask="0x1" edc:name="OCFAR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR5" edc:desc="" edc:mask="0x1" edc:name="OCFAR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR18" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR18" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXR" edc:desc="" edc:mask="0x3f" edc:name="U1RXR" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U1CTSR" edc:desc="" edc:mask="0x3f" edc:name="U1CTSR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXR0" edc:desc="" edc:mask="0x1" edc:name="U1RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR1" edc:desc="" edc:mask="0x1" edc:name="U1RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR2" edc:desc="" edc:mask="0x1" edc:name="U1RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR3" edc:desc="" edc:mask="0x1" edc:name="U1RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR4" edc:desc="" edc:mask="0x1" edc:name="U1RXR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR5" edc:desc="" edc:mask="0x1" edc:name="U1RXR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U1CTSR0" edc:desc="" edc:mask="0x1" edc:name="U1CTSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR1" edc:desc="" edc:mask="0x1" edc:name="U1CTSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR2" edc:desc="" edc:mask="0x1" edc:name="U1CTSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR3" edc:desc="" edc:mask="0x1" edc:name="U1CTSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR4" edc:desc="" edc:mask="0x1" edc:name="U1CTSR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR5" edc:desc="" edc:mask="0x1" edc:name="U1CTSR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
