balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ09GS302.PIC
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR20" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR20" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDI1R" edc:desc="" edc:mask="0x3f" edc:name="SDI1R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCK1R" edc:desc="" edc:mask="0x3f" edc:name="SCK1R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SDI1R0" edc:desc="" edc:mask="0x1" edc:name="SDI1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R1" edc:desc="" edc:mask="0x1" edc:name="SDI1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R2" edc:desc="" edc:mask="0x1" edc:name="SDI1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R3" edc:desc="" edc:mask="0x1" edc:name="SDI1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R4" edc:desc="" edc:mask="0x1" edc:name="SDI1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R5" edc:desc="" edc:mask="0x1" edc:name="SDI1R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SCK1R0" edc:desc="" edc:mask="0x1" edc:name="SCK1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R1" edc:desc="" edc:mask="0x1" edc:name="SCK1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R2" edc:desc="" edc:mask="0x1" edc:name="SCK1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R3" edc:desc="" edc:mask="0x1" edc:name="SCK1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R4" edc:desc="" edc:mask="0x1" edc:name="SCK1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R5" edc:desc="" edc:mask="0x1" edc:name="SCK1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPINR21" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR21" edc:nzwidth="0x10" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SS1R" edc:desc="" edc:mask="0x3f" edc:name="SS1R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SS1R0" edc:desc="" edc:mask="0x1" edc:name="SS1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R1" edc:desc="" edc:mask="0x1" edc:name="SS1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R2" edc:desc="" edc:mask="0x1" edc:name="SS1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R3" edc:desc="" edc:mask="0x1" edc:name="SS1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R4" edc:desc="" edc:mask="0x1" edc:name="SS1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R5" edc:desc="" edc:mask="0x1" edc:name="SS1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="14"/>
        <edc:SFRDef edc:access="--nnnnnn--------" edc:cname="RPINR29" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--------" edc:name="RPINR29" edc:nzwidth="0x10" edc:por="--111111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="FLT1R" edc:desc="" edc:mask="0x3f" edc:name="FLT1R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="FLT1R0" edc:desc="" edc:mask="0x1" edc:name="FLT1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT1R1" edc:desc="" edc:mask="0x1" edc:name="FLT1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT1R2" edc:desc="" edc:mask="0x1" edc:name="FLT1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT1R3" edc:desc="" edc:mask="0x1" edc:name="FLT1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT1R4" edc:desc="" edc:mask="0x1" edc:name="FLT1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT1R5" edc:desc="" edc:mask="0x1" edc:name="FLT1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR30" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR30" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLT2R" edc:desc="" edc:mask="0x3f" edc:name="FLT2R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT3R" edc:desc="" edc:mask="0x3f" edc:name="FLT3R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLT2R0" edc:desc="" edc:mask="0x1" edc:name="FLT2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT2R1" edc:desc="" edc:mask="0x1" edc:name="FLT2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT2R2" edc:desc="" edc:mask="0x1" edc:name="FLT2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT2R3" edc:desc="" edc:mask="0x1" edc:name="FLT2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT2R4" edc:desc="" edc:mask="0x1" edc:name="FLT2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT2R5" edc:desc="" edc:mask="0x1" edc:name="FLT2R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT3R0" edc:desc="" edc:mask="0x1" edc:name="FLT3R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT3R1" edc:desc="" edc:mask="0x1" edc:name="FLT3R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT3R2" edc:desc="" edc:mask="0x1" edc:name="FLT3R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT3R3" edc:desc="" edc:mask="0x1" edc:name="FLT3R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT3R4" edc:desc="" edc:mask="0x1" edc:name="FLT3R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT3R5" edc:desc="" edc:mask="0x1" edc:name="FLT3R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR31" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR31" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLT4R" edc:desc="" edc:mask="0x3f" edc:name="FLT4R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT5R" edc:desc="" edc:mask="0x3f" edc:name="FLT5R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLT4R0" edc:desc="" edc:mask="0x1" edc:name="FLT4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT4R1" edc:desc="" edc:mask="0x1" edc:name="FLT4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT4R2" edc:desc="" edc:mask="0x1" edc:name="FLT4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT4R3" edc:desc="" edc:mask="0x1" edc:name="FLT4R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT4R4" edc:desc="" edc:mask="0x1" edc:name="FLT4R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT4R5" edc:desc="" edc:mask="0x1" edc:name="FLT4R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT5R0" edc:desc="" edc:mask="0x1" edc:name="FLT5R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT5R1" edc:desc="" edc:mask="0x1" edc:name="FLT5R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT5R2" edc:desc="" edc:mask="0x1" edc:name="FLT5R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT5R3" edc:desc="" edc:mask="0x1" edc:name="FLT5R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT5R4" edc:desc="" edc:mask="0x1" edc:name="FLT5R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT5R5" edc:desc="" edc:mask="0x1" edc:name="FLT5R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR32" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR32" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLT6R" edc:desc="" edc:mask="0x3f" edc:name="FLT6R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT7R" edc:desc="" edc:mask="0x3f" edc:name="FLT7R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLT6R0" edc:desc="" edc:mask="0x1" edc:name="FLT6R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT6R1" edc:desc="" edc:mask="0x1" edc:name="FLT6R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT6R2" edc:desc="" edc:mask="0x1" edc:name="FLT6R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT6R3" edc:desc="" edc:mask="0x1" edc:name="FLT6R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT6R4" edc:desc="" edc:mask="0x1" edc:name="FLT6R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT6R5" edc:desc="" edc:mask="0x1" edc:name="FLT6R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT7R0" edc:desc="" edc:mask="0x1" edc:name="FLT7R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT7R1" edc:desc="" edc:mask="0x1" edc:name="FLT7R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT7R2" edc:desc="" edc:mask="0x1" edc:name="FLT7R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT7R3" edc:desc="" edc:mask="0x1" edc:name="FLT7R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT7R4" edc:desc="" edc:mask="0x1" edc:name="FLT7R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT7R5" edc:desc="" edc:mask="0x1" edc:name="FLT7R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR33" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR33" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLT8R" edc:desc="" edc:mask="0x3f" edc:name="FLT8R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SYNCI1R" edc:desc="" edc:mask="0x3f" edc:name="SYNCI1R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLT8R0" edc:desc="" edc:mask="0x1" edc:name="FLT8R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT8R1" edc:desc="" edc:mask="0x1" edc:name="FLT8R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT8R2" edc:desc="" edc:mask="0x1" edc:name="FLT8R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT8R3" edc:desc="" edc:mask="0x1" edc:name="FLT8R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT8R4" edc:desc="" edc:mask="0x1" edc:name="FLT8R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT8R5" edc:desc="" edc:mask="0x1" edc:name="FLT8R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SYNCI1R0" edc:desc="" edc:mask="0x1" edc:name="SYNCI1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCI1R1" edc:desc="" edc:mask="0x1" edc:name="SYNCI1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCI1R2" edc:desc="" edc:mask="0x1" edc:name="SYNCI1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCI1R3" edc:desc="" edc:mask="0x1" edc:name="SYNCI1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCI1R4" edc:desc="" edc:mask="0x1" edc:name="SYNCI1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCI1R5" edc:desc="" edc:mask="0x1" edc:name="SYNCI1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------------" edc:cname="RPINR34" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR34" edc:nzwidth="16" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNCI2R" edc:desc="" edc:mask="0x3f" edc:name="SYNCI2R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SYNCI2R0" edc:desc="" edc:mask="0x1" edc:name="SYNCI2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCI2R1" edc:desc="" edc:mask="0x1" edc:name="SYNCI2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCI2R2" edc:desc="" edc:mask="0x1" edc:name="SYNCI2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCI2R3" edc:desc="" edc:mask="0x1" edc:name="SYNCI2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCI2R4" edc:desc="" edc:mask="0x1" edc:name="SYNCI2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNCI2R5" edc:desc="" edc:mask="0x1" edc:name="SYNCI2R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="10"/>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR0" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP0R" edc:desc="" edc:mask="0x3f" edc:name="RP0R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP1R" edc:desc="" edc:mask="0x3f" edc:name="RP1R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP0R0" edc:desc="" edc:mask="0x1" edc:name="RP0R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R1" edc:desc="" edc:mask="0x1" edc:name="RP0R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R2" edc:desc="" edc:mask="0x1" edc:name="RP0R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R3" edc:desc="" edc:mask="0x1" edc:name="RP0R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R4" edc:desc="" edc:mask="0x1" edc:name="RP0R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R5" edc:desc="" edc:mask="0x1" edc:name="RP0R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP1R0" edc:desc="" edc:mask="0x1" edc:name="RP1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R1" edc:desc="" edc:mask="0x1" edc:name="RP1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R2" edc:desc="" edc:mask="0x1" edc:name="RP1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R3" edc:desc="" edc:mask="0x1" edc:name="RP1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R4" edc:desc="" edc:mask="0x1" edc:name="RP1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R5" edc:desc="" edc:mask="0x1" edc:name="RP1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR1" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP2R" edc:desc="" edc:mask="0x3f" edc:name="RP2R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP3R" edc:desc="" edc:mask="0x3f" edc:name="RP3R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP2R0" edc:desc="" edc:mask="0x1" edc:name="RP2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R1" edc:desc="" edc:mask="0x1" edc:name="RP2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R2" edc:desc="" edc:mask="0x1" edc:name="RP2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R3" edc:desc="" edc:mask="0x1" edc:name="RP2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R4" edc:desc="" edc:mask="0x1" edc:name="RP2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP2R5" edc:desc="" edc:mask="0x1" edc:name="RP2R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP3R0" edc:desc="" edc:mask="0x1" edc:name="RP3R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R1" edc:desc="" edc:mask="0x1" edc:name="RP3R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R2" edc:desc="" edc:mask="0x1" edc:name="RP3R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R3" edc:desc="" edc:mask="0x1" edc:name="RP3R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R4" edc:desc="" edc:mask="0x1" edc:name="RP3R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP3R5" edc:desc="" edc:mask="0x1" edc:name="RP3R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR2" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP4R" edc:desc="" edc:mask="0x3f" edc:name="RP4R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP5R" edc:desc="" edc:mask="0x3f" edc:name="RP5R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP4R0" edc:desc="" edc:mask="0x1" edc:name="RP4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R1" edc:desc="" edc:mask="0x1" edc:name="RP4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R2" edc:desc="" edc:mask="0x1" edc:name="RP4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R3" edc:desc="" edc:mask="0x1" edc:name="RP4R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R4" edc:desc="" edc:mask="0x1" edc:name="RP4R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R5" edc:desc="" edc:mask="0x1" edc:name="RP4R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP5R0" edc:desc="" edc:mask="0x1" edc:name="RP5R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R1" edc:desc="" edc:mask="0x1" edc:name="RP5R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R2" edc:desc="" edc:mask="0x1" edc:name="RP5R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R3" edc:desc="" edc:mask="0x1" edc:name="RP5R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R4" edc:desc="" edc:mask="0x1" edc:name="RP5R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP5R5" edc:desc="" edc:mask="0x1" edc:name="RP5R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR3" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP6R" edc:desc="" edc:mask="0x3f" edc:name="RP6R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP7R" edc:desc="" edc:mask="0x3f" edc:name="RP7R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP6R0" edc:desc="" edc:mask="0x1" edc:name="RP6R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R1" edc:desc="" edc:mask="0x1" edc:name="RP6R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R2" edc:desc="" edc:mask="0x1" edc:name="RP6R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R3" edc:desc="" edc:mask="0x1" edc:name="RP6R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R4" edc:desc="" edc:mask="0x1" edc:name="RP6R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R5" edc:desc="" edc:mask="0x1" edc:name="RP6R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP7R0" edc:desc="" edc:mask="0x1" edc:name="RP7R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R1" edc:desc="" edc:mask="0x1" edc:name="RP7R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R2" edc:desc="" edc:mask="0x1" edc:name="RP7R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R3" edc:desc="" edc:mask="0x1" edc:name="RP7R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R4" edc:desc="" edc:mask="0x1" edc:name="RP7R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R5" edc:desc="" edc:mask="0x1" edc:name="RP7R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
